# 写一个周易起卦程序，给自己生活以指导
# 首先是随机数生成，用0代表阴，1代表阳
# 起卦方法：先采用硬币起卦法，三个硬币，从下往上生成卦
# 导入需要的库
import random as r

# 同时抛掷3枚硬币，
# 两阴一阳为少阳（7表示），三阳为老阳（9表示），需变卦
# 两阳一阴为少阴（8表示），三阴为老阴（6表示），需变卦
# 因为加入顺序是无关的，我们让列表元素从小排到大，方便判断
# 2.0新增功能
# 接下来需要一个字典，可以索引对应的卦，这个留到明天吧
# 先3爻对应八卦，再两个卦再组合
# 八卦对应的字典
G_8_dict = {"000":"坤/地","001":"艮/山","010":"坎/水","011":"巽/风",
            "100":"震/雷","101":"离/火","110":"兑/泽","111":"乾/天"}
# 六十四卦对应的字典,这个室友固有顺序的，还是按顺序写
G_64_dict = {"111111":"天天乾","000000":"地地坤","100010":"水雷屯",
            "010001":"山水蒙","111010":"水天需","010111":"天水讼",
            "010000":"地水师","000010":"水地比","111011":"风天小畜",
            "110111":"天泽履","111000":"地天泰","000111":"天地否",
            "101111":"天火同人","111101":"水天大有","001000":"地山谦",
            "000100":"雷地豫","100110":"泽雷随","011001":"山风蛊",
            "110000":"地泽临","000011":"风地观","100101":"火雷噬嗑",
            "101001":"山火贲","000001":"山地剥","100000":"地雷复",
            "100111":"天雷无妄","111001":"山天大畜","100001":"山雷颐",
            "011110":"泽风大过","010010":"水水坎","101101":"火火离",
            "001110":"泽山咸","011100":"雷风恒","001111":"天山遁",
            "111100":"雷天大壮","000101":"火地晋","101000":"地火明夷",
            "101011":"风火家人","110101":"火泽睽","001010":"水山蹇",
            "010100":"雷水解","110001":"山泽损","100011":"风雷益",
            "111110":"泽天夬","011111":"天风姤","000110":"泽地萃",
            "011000":"地风升","010110":"泽水困","011010":"水风井",
            "101110":"泽火革","011101":"火风鼎","100100":"雷雷震",
            "001001":"山山艮","001011":"风山渐","110100":"雷泽归妹",
            "101100":"雷火丰","001101":"火山旅","011011":"风风巽",
            "110110":"泽泽兑","010011":"风水涣","110010":"水泽节",
            "110011":"风泽中孚","001100":"雷山小过","101010":"水火既济",
            "010101":"火水未济"}

YinYangDict = {'000':6,"011":8,"001":7,"111":9}
Gua = []
for i in range(6):
    num = []
    for j in range(3):
        num.append(r.randint(0,1))
    num.sort()
    Gua.insert(0,YinYangDict["%d%d%d"%(num[0],num[1],num[2])])
print(Gua)

# 变卦 老阴变阳，老阳变阴
YuanGua = ""
BianGua = ""
for y in Gua:
    if y == 6:
        YuanGua += '0'
        BianGua += '1'
    elif y == 9:
        YuanGua += '1'
        BianGua += '0'
    elif y == 7:
        YuanGua += '1'
        BianGua += '1' 
    else :
        YuanGua += '0'
        BianGua += '0'      
print(YuanGua,'--->',BianGua)
print(G_64_dict[YuanGua],'--->',G_64_dict[BianGua])